# python pandas


# # how pandas differ from numpy

## pandas:

 pandas is defined as an open source library that provides high performance data manipulation in python .it is built on the numpy package,which means numpy is required for operating the pandas.the name os pandas is derived from the word panel data,which means an econometrics from multidimentional data.it is used for data analysis in python and develeoped by wes mckinney in 2008

## numpy

But compared to numpy it is mostly based on the c language,and it is an extension module of python.it is defined as a python package used for performibng the various numerical computtations and processing of thre multidimentional and sinflr-dimentional array elements .the calciulations using numpy arrays are faster then the norml python array.

 the numpy pacakage is created by travis oliphant in 2005 by adding the functionalitis of the ancestors module numeric into another modulr numarray.

## difference

1.the pandas module mainely works with the tabular data,where as the numpy module works with the numerical data

2.the pandas provides some sets of powerful toools like dataframe and series that mainely used for analyzing the data where as in numpy 

3.the performance of numpy is better than numpy for 50k rows or less

4.the performance of pandas is better than numpy for 500k rows or more

5.numpy haa less memory than pandas


## 1. pandas features

### 1.1 handling of data:

pandas library provides a really fast and efficient way to manage and explore data.it does that by providing us with series and dataframes,which are explore data.it does that by providing us with series and data frames,which help us not only the represent data efficiency but also manulpiate it in various ways.these features of pandas is exectly what makes it such an attractive library for data scientists

### 1.2 alignment and indexing:

 having adat is useles   if you dont know where it belongs and what it tells us aboout so,labelelling of data is very imp and indexing

### 1.3 handeling missing data

 missing data can be ghandeleld very well in pandas

### 1.4 cleaning up data

it is very imp that we clean data up

### 1.5 input and output tools

inputing and outputiing data is very imp,just like we can asscess jason file,note file ,c file  etc...any typr of file

### 1.6 multiple file formats supports

 we can access various file formats

### 1.7 merging and jooining of datasets

### 1.8 a lot of time series

### 1.9 optimized performance

### 1.10 python support

### 1.11 visualize

### 1.12 grouping

### 1.13 mask data:  (hiding data)

### 1.14 unique data

### 1.15 perform mathematical operations of data

In [1]:
import pandas as pd

# 2.series

it is fundamental piece of data structure.it is basicallynothing but one dimentional arrays and seqence of values

### 2.1 parameters

data:value you want your series to posses
     
index:index related to the value you use for series
     
dtype:the specifies the type of value in the series
     
copy:it copies the data which was input

### creation

In [7]:
import pandas as pd
obj=pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

## creating series with numpy array of alphabets

In [3]:
import pandas as pd
import numpy as np
npa=np.array(['d','a','t','a'])
print(npa)
dat1=pd.Series(npa)
dat1

['d' 'a' 't' 'a']

0    d
1    a
2    t
3    a
dtype: object

## creating series with numpy array of numbers

In [9]:
import numpy as np
npa=np.array([1,2,3,4])
print(npa)
dat1=pd.Series(npa)
dat1

[1 2 3 4]

0    1
1    2
2    3
3    4
dtype: int32

## creating with python dictionary

In [4]:
a={'delhi':12.7,'mumbai':2.4,'kolkata':3.6}
b=pd.Series(a)
b

delhi      12.7
mumbai      2.4
kolkata     3.6
dtype: float64

## how to change the index of pandas series

In [13]:
num=['a1','a2','a3','a4']
arr2=pd.Series([5,5,-3,3],index=num)
arr2

a1    5
a2    5
a3   -3
a4    3
dtype: int64

## we can retrieve directly from panda series

##### print(arr2.values)
print(arr2.index)

In [18]:
print(obj2['a'])
obj2['d']=6
obj2[['c','a','d']]

-5

c    3
a   -5
d    6
dtype: int64

In [3]:
import pandas as pd
obj2=pd.Series([4,7,-5,3],index=['d','b','a','c'])
print(obj2)
obj2.index

d    4
b    7
a   -5
c    3
dtype: int64

Index(['d', 'b', 'a', 'c'], dtype='object')

#### Q1 write a pyhton program to create pandas series obj with elements 1-30.but a no from the user between 1 to 30 and print subset of given series based on the value

In [53]:
import pandas as pd
l= []
for i in range (1,31):
       l.append(i)
p=pd.Series(l)
n=int(input("enter values"))
print(p[0:n+1])

enter values5
0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

### Write a Pandas program to create a subset of a given series based on value and condition.

In [18]:
import pandas as pd
s = pd.Series([0, 1,2,3,4,5,6,7,8,9,10])
print("Original Data Series:")
print(s)
print("\nSubset of the above Data Series:")
n = 6
new_s = s[s < n]
print(new_s)

Original Data Series:
0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
dtype: int64

Subset of the above Data Series:
0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

#### Q3 write a program in pandas two compare elements of two panads series

In [24]:
import pandas as pd
ds1 = pd.Series([2, 4, 6, 8, 10])
ds2 = pd.Series([1, 3, 5, 7, 10])
print("S1:")
print(ds1)
print("S2:")
print(ds2)
print("Compare:")
print("Equals:")
print(ds1==ds2)
print("Greater than:")
print(ds1 > ds2)
print("Less than:")
print(ds1 < ds2)

S1:
0     2
1     4
2     6
3     8
4    10
dtype: int64
S2:
0     1
1     3
2     5
3     7
4    10
dtype: int64
Compare:
Equals:
0    False
1    False
2    False
3    False
4     True
dtype: bool
Greater than:
0     True
1     True
2     True
3     True
4    False
dtype: bool
Less than:
0    False
1    False
2    False
3    False
4    False
dtype: bool

#### Q4 write a program in pandas to convert given series to an array and dictionary

In [51]:
import pandas as pd
import numpy as np
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series:")
print(s1)
print("Series to an array")
a = np.array(s1.values.tolist())
print (a)

Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object
Series to an array
['100' '200' 'python' '300.12' '400']

#### Q5 write a pandas program to stack the two given vsrticallynand horizontally and use concatenate function

In [22]:
import pandas as pd
series1 = pd.Series(range(10))
series2 = pd.Series(list('pqrstuvwxy'))
print("Original Series:")
print(series1)
print(series2)
series1.append(series2)
df = pd.concat([series1, series2], axis=1)
print("\nStack two given series vertically and horizontally:")
print(df)

Original Series:
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64
0    p
1    q
2    r
3    s
4    t
5    u
6    v
7    w
8    x
9    y
dtype: object

Stack two given series vertically and horizontally:
   0  1
0  0  p
1  1  q
2  2  r
3  3  s
4  4  t
5  5  u
6  6  v
7  7  w
8  8  x
9  9  y

#### Q6 write a pandas program to sort given series

In [3]:
import pandas as pd
n1=['a1','a2','a3','a4']
a=pd.Series([2,3,4,-6])
print(a)
a=pd.Series([3,4,-6,7],index=n1)
a

0    2
1    3
2    4
3   -6
dtype: int64

a1    3
a2    4
a3   -6
a4    7
dtype: int64

In [6]:
import pandas as np
import numpy as np
n=int(input("enter the values:"))
s = pd.Series(['2','3','4','5','6'])
print(s)
s1 = pd.Series(s).sort_values()
print(s1)

enter the values:5
0    2
1    3
2    4
3    5
4    6
dtype: object
0    2
1    3
2    4
3    5
4    6
dtype: object

# dataframes

data sets pands are usally mult dimentional tables,called dataframes,series like a column ,a data frames is a whole table
data frame is like a column ,a dataframe is a whole table

dataframe is defined as a standard way to store data that has two different indexes, i.e., row index and column index .it consists of the following propertirs:
     
        the column can  be heterogenious types like int ,boll,and so on.
        
        it can be seen as directory of series structures here booth the rows and columns and indesxed .it is denoted as "column" in case of columns and "index" in case of rows

## create an empty dataframes

In [10]:
#importing pandas library
import pandas as pd
df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [9]:
#list of strings
x=['python','pandas']
#callind dtaframes constructor on list
df=pd.DataFrame(x)
print(df)

        0
0  python
1  pandas

In [14]:
# create a dataframe from dict of ndarray/lists
import pandas as pd
info={'1D':[101,102,103],'Department':['cse','ece','it']}
df=pd.DataFrame(info)
print(df)

    1D Department
0  101        cse
1  102        ece
2  103         it

In [18]:
#importing the pandas library
import pandas as pd
info={'one':pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f']), 'two':pd.Series([1,2,3,4,5,6,7,8], index=['a','b','c','d','e','f','g','h'])}
d1=pd.DataFrame(info)
print(d1)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  4.0    4
e  5.0    5
f  6.0    6
g  NaN    7
h  NaN    8

### locate row

as you can see from the result above, the data frames is like a table rows and a columns. 

psnad use the loc attribute to return one or mor e specified row's

### refer to the row index:
print(df.loc[0])

### use a list of indexes:
print(df.loc[[0,1]])

# named indexes

with the index argument ,you can name your own indexes.

In [19]:
import pandas as pd
data={ "calories":[23,56,78,99],"duration":[23,56,78,90]}
df=pd.DataFrame(data, index=["day1","day2","day3","day4"])
print(df)

      calories  duration
day1        23        23
day2        56        56
day3        78        78
day4        99        90

#### how to add new column by passing the series

In [21]:
import pandas as pd
info={'one':pd.Series([1,2,3,4,5],index=['a','b','c','d','e']), 'two':pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'])}
df=pd.DataFrame(info)
#add a new column to an existing data frames object
print("add new column by passing series")
df['three']=pd.Series([20,40,60],index=['a','b','c'])
print(df)
print("add new column using existing dataframe columns")
df['four']=df['one']+df['three']
print(df)

add new column by passing series
   one  two  three
a  1.0    1   20.0
b  2.0    2   40.0
c  3.0    3   60.0
d  4.0    4    NaN
e  5.0    5    NaN
f  NaN    6    NaN
add new column using existing dataframe columns
   one  two  three  four
a  1.0    1   20.0  21.0
b  2.0    2   40.0  42.0
c  3.0    3   60.0  63.0
d  4.0    4    NaN   NaN
e  5.0    5    NaN   NaN
f  NaN    6    NaN   NaN

# python data frames

a dataframes rrepresents a rectangukar table of the data and countaind=s an ordered collecton of columns ,each values diff value type(numeric,string,boolean,etc..) .the cdata frome hass both  row ans column indes:
    ot can through of as dict series all sharing the same index.under the hood ,the dat ais stored as one or more 2D blocks rather than a loist,dict,or some other collection of 1d arrays 
    
    there are many ways to construct ddata frames

## 1.creating pandas data frames

In [7]:
import numpy as np
import pandas as pd
d={'x':[1,2,3],'y':np.array([2,4,8]),'z':200}
pd.DataFrame(d)

   x  y    z
0  1  2  200
1  2  4  200
2  3  8  200

In [8]:
pd.DataFrame(d,index=[100,200,300],columns=['z','y','x'])

       z  y  x
100  200  2  1
200  200  4  2
300  200  8  3

## 2.creating pandas dataframe with lists

In [13]:
import pandas as pd
l=[{'x':1,'y':2,'z':100},
   {'x':2,'y':4,'z':100},
   {'x':3,'y':6,'z':100}]
pd.DataFrame(l)

   x  y    z
0  1  2  100
1  2  4  100
2  3  6  100

In [14]:
import pandas as pd
l=[{'x':1,'y':2,'z':100},
   {'x':2,'y':4,'z':200},
   {'x':3,'y':6,'z':300}]
pd.DataFrame(l)

   x  y    z
0  1  2  100
1  2  4  200
2  3  6  300

In [15]:
import pandas as pd
l=[{'x':1,'y':2,'z':100},
   {'x':2,'y':4,'z':200},
   {'x':3,'y':6,'z':300}]
pd.Series(l)

0    {'x': 1, 'y': 2, 'z': 100}
1    {'x': 2, 'y': 4, 'z': 200}
2    {'x': 3, 'y': 6, 'z': 300}
dtype: object

## 3.creating a pandas DataFrames with numpy array

In [17]:
import numpy as np
import pandas as pd
arr=np.array([[1,2,3],[4,5,6],[7,8,9]])
df=pd.DataFrame(arr)
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [18]:
arr[0,0]=1001
df

      0  1  2
0  1001  2  3
1     4  5  6
2     7  8  9

In [19]:
import numpy as np
import pandas as pd
arr=np.array([[1,2,3],[4,5,6],[7,8,9]])
df=pd.DataFrame(arr,columns=['x','y','z'],index=['a','b','c'])
df

   x  y  z
a  1  2  3
b  4  5  6
c  7  8  9

## 4.creating pandas dataframe from files

one can save and load dtat and labels fro a pandas dataframes to and from a number of file types,including CSV,Excel,SQL,JSON and more
this is very powerful feature

In [24]:
import pandas as pd
data={'state':['ohio','ohio','ohio','indiaa','india','india'],
      'year':[200,221,242,234,5477,768],
     'pop':[32,23,45,456,56,67]}
pd.DataFrame(data)

    state  year  pop
0    ohio   200   32
1    ohio   221   23
2    ohio   242   45
3  indiaa   234  456
4   india  5477   56
5   india   768   67

In [30]:
frame2=pd.DataFrame(data,columns=['year','state','pop','year'])

In [27]:
print(frame2['state'])
print(frame2.year)

0      ohio
1      ohio
2      ohio
3    indiaa
4     india
5     india
Name: state, dtype: object
   year  year
0   200   200
1   221   221
2   242   242
3   234   234
4  5477  5477
5   768   768

In [31]:
print(frame2.state)

0      ohio
1      ohio
2      ohio
3    indiaa
4     india
5     india
Name: state, dtype: object

In [37]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],
                   index=['one','two','three','four','five','six'])
print(frame2)
frame2.columns

       year   state  pop debt
one     200    ohio   32  NaN
two     221    ohio   23  NaN
three   242    ohio   45  NaN
four    234  indiaa  456  NaN
five   5477   india   56  NaN
six     768   india   67  NaN

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [38]:
frame2.loc

In [40]:
frame2['debt']=16.5
print(frame2)
frame2['debt']=np.arange(6.)
frame2

       year   state  pop  debt
one     200    ohio   32  16.5
two     221    ohio   23  16.5
three   242    ohio   45  16.5
four    234  indiaa  456  16.5
five   5477   india   56  16.5
six     768   india   67  16.5

       year   state  pop  debt
one     200    ohio   32   0.0
two     221    ohio   23   1.0
three   242    ohio   45   2.0
four    234  indiaa  456   3.0
five   5477   india   56   4.0
six     768   india   67   5.0

In [41]:
val=pd.Series([-1.2,-2.3,4.5],index=['two','three','four'])
frame2['debt']=val
frame2

       year   state  pop  debt
one     200    ohio   32   NaN
two     221    ohio   23  -1.2
three   242    ohio   45  -2.3
four    234  indiaa  456   4.5
five   5477   india   56   NaN
six     768   india   67   NaN

In [42]:
frame2['eastern']=frame2.state=='ohio'
frame2

       year   state  pop  debt  eastern
one     200    ohio   32   NaN     True
two     221    ohio   23  -1.2     True
three   242    ohio   45  -2.3     True
four    234  indiaa  456   4.5    False
five   5477   india   56   NaN    False
six     768   india   67   NaN    False

In [43]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [44]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [45]:
pop={'india':{234:432,5477:233},
     'ohio':{200:1.3,221:445}}

In [46]:
print(frame2)

       year   state  pop  debt
one     200    ohio   32   NaN
two     221    ohio   23  -1.2
three   242    ohio   45  -2.3
four    234  indiaa  456   4.5
five   5477   india   56   NaN
six     768   india   67   NaN

In [48]:
frame2.T    ## .T   ---> is callesd transpose

        one   two three    four   five    six
year    200   221   242     234   5477    768
state  ohio  ohio  ohio  indiaa  india  india
pop      32    23    45     456     56     67
debt    NaN  -1.2  -2.3     4.5    NaN    NaN

In [65]:
pd.DataFrame(pop,index=['year','pop','state'],columns=['one','two','three'])

       one  two three
year   NaN  NaN   NaN
pop    NaN  NaN   NaN
state  NaN  NaN   NaN

In [63]:
frame2.values

array([[200, 'ohio', 32, nan],
       [221, 'ohio', 23, -1.2],
       [242, 'ohio', 45, -2.3],
       [234, 'indiaa', 456, 4.5],
       [5477, 'india', 56, nan],
       [768, 'india', 67, nan]], dtype=object)

# index objects

pandas index objects are responsible for hols=ding the axis labels and other and other meta data(like the axis name or names) any arrays or the array or other sequnece of lables you can use when constructing a series or data frames is internally converted to index

unlike python sets,a pandas index can contain duplicate labels .selected with duplicates labels will select thre occurences of labels .each index has a number of methods and properties

union,isin,delete=te ,drop,insert,is_monotonic,is_unique,unique

In [6]:
import pandas as pd
import numpy as np
labels=pd.Index(np.arange(3))
print(labels)
obj2=pd.Series([1.2,-2.3,0],index=labels)
print(obj2)
obj2.index is labels

Int64Index([0, 1, 2], dtype='int64')
0    1.2
1   -2.3
2    0.0
dtype: float64

True

In [10]:
import pandas as pd
df1=pd.Index([12,32,12,76,76,89])
df2=pd.Index([1,2,3,4])
print(df1,"/n",df2)
app=df1.append(df2)
print(app)
uni=df1.union(df2)
print(uni)
diff=df1.difference(df2)
print(diff)
inte=df1.intersection(df2)
print(inte)

Int64Index([12, 32, 12, 76, 76, 89], dtype='int64') /n Int64Index([1, 2, 3, 4], dtype='int64')
Int64Index([12, 32, 12, 76, 76, 89, 1, 2, 3, 4], dtype='int64')
Int64Index([1, 2, 3, 4, 12, 12, 32, 76, 76, 89], dtype='int64')
Int64Index([12, 32, 76, 89], dtype='int64')
Int64Index([], dtype='int64')

In [12]:
print(df1)
print(df2)
print(df1.unique())
print(df2.unique())
print(df1.is_unique)
print(df2.is_unique)
print(df1.is_monotonic)
print(df2.is_monotonic)

Int64Index([12, 32, 12, 76, 76, 89], dtype='int64')
Int64Index([1, 2, 3, 4], dtype='int64')
Int64Index([12, 32, 76, 89], dtype='int64')
Int64Index([1, 2, 3, 4], dtype='int64')
False
True
False
True

In [13]:
print(df1)
df4=df1.delete(2)
print(df4)

Int64Index([12, 32, 12, 76, 76, 89], dtype='int64')
Int64Index([12, 32, 76, 76, 89], dtype='int64')

# reindexing

it is an importing method on pandas objects ids reindex

method

index,method ,fill_value,limit,tolerance level,copy

In [15]:
import pandas as pd
obj=pd.Series([4.,6.7,3.5,-2.3],index=['a','b','c','d'])
obj

a    4.0
b    6.7
c    3.5
d   -2.3
dtype: float64

In [17]:
obj2=obj.reindex(['a','b','c','d'])
obj2

a    4.0
b    6.7
c    3.5
d   -2.3
dtype: float64

In [29]:
import numpy as np
import pandas as pd
df1=pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df2=pd.DataFrame(np.random.randn(2,3),columns=['col1','col2','col3'])
print(df2)
print(df1)
df1=df1.reindex_like(df2)
print(df1)

       col1      col2      col3
0  0.476774 -1.526265  0.159276
1  0.317109  0.233479  0.971219
       col1      col2      col3
0 -0.890402  1.381071 -1.216618
1 -1.056309 -0.251889  0.469635
2 -1.678778 -0.511836 -0.209638
3  0.171965 -0.529961 -0.308361
4  2.258007  0.022666 -0.135506
5 -0.262986  0.695262  1.424198
       col1      col2      col3
0 -0.890402  1.381071 -1.216618
1 -1.056309 -0.251889  0.469635

In [23]:
obj3=pd.Series(['blue','purple','orange','green'])
print(obj3)
obj4=obj3.reindex(range(6),method='ffill')
print(obj4)

0      blue
1    purple
2    orange
3     green
dtype: object
0      blue
1    purple
2    orange
3     green
4     green
5     green
dtype: object

# limits

In [28]:
import numpy as np
import pandas as pd
df1=pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df2=pd.DataFrame(np.random.randn(2,3),columns=['col1','col2','col3'])
print(df2.reindex_like(df1))
print(df2.reindex_like(df1,method='ffill'))

       col1      col2      col3
0  0.601172 -0.939795  0.633862
1  0.412832  0.435180 -1.423087
2       NaN       NaN       NaN
3       NaN       NaN       NaN
4       NaN       NaN       NaN
5       NaN       NaN       NaN
       col1      col2      col3
0  0.601172 -0.939795  0.633862
1  0.412832  0.435180 -1.423087
2  0.412832  0.435180 -1.423087
3  0.412832  0.435180 -1.423087
4  0.412832  0.435180 -1.423087
5  0.412832  0.435180 -1.423087